export default () =>
  `Нам необходимо обрабатывать информацию о вас для предоставления Продуктов Facebook.
  Типы информации, которую мы собираем, зависят от того, как вы используете наши
  Продукты. Чтобы узнать, как получить доступ к информации, которую мы собираем, и
  удалить ее, зайдите в Настройки Facebook и Настройки Instagram. Ваши действия,
  действия других людей и предоставляемая вами и ими информация. Предоставляемые вами
  информация и контент. Мы собираем контент, сообщения и другую информацию, которые вы
  предоставляете при использовании наших Продуктов, в том числе когда вы регистрируете
  аккаунт, создаете контент или делитесь им, отправляете сообщения или взаимодействуете
  с другими людьми. Это может быть информация из предоставляемого вами контента или о
  нем (такая как метаданные), например место, где было сделано фото, или дата создания
  файла. Кроме того, мы можем собирать данные о том, что вы видите, с помощью
  предоставляемых нами функций, таких как наша камера, например, чтобы предлагать маски
  и фильтры, которые могут вам понравиться, или давать советы по использованию форматов
  камеры. Наши системы автоматически обрабатывают контент и сообщения, предоставляемые
  вами и другими людьми, для анализа их контекста и содержания в целях, описанных ниже.
  Узнайте больше о контроле над тем, кто может видеть то, чем вы делитесь. Данные с
  особой защитой В полях профиля Facebook или Событиях из жизни вы можете по желанию
  указать информацию о своих религиозных убеждениях, политических взглядах, лицах,
  которые вас интересуют, или состоянии вашего здоровья. Эта и другая информация (в том
  числе раса и этническое происхождение, философские взгляды или членство в профсоюзах)
  может требовать применения особых мер защиты в соответствии с законодательством вашей
  страны. Сообщества и связи. Мы собираем информацию о людях, Страницах, аккаунтах,
  хэштегах и группах, с которыми вы связаны, и о вашем взаимодействии с ними в различных
  Продуктах Facebook. Это, например, люди, с которыми вы больше всего общаетесь, или
  группы, к которым вы присоединились. Мы также собираем контактную информацию, если вы
  загружаете, синхронизируете или импортируете ее с устройства (например, адресную
  книгу, журнал вызовов или SMS), и используем ее, к примеру, чтобы помогать вам и
  другим пользователям находить людей, которых вы можете знать, и в других целях,
  перечисленных ниже. Использование вами Продуктов. Мы собираем информацию о том, как вы
  используете наши Продукты, такую как типы контента, который вы просматриваете или с
  которым вы взаимодействуете; функции, которые вы используете; действия, которые вы
  совершаете; люди или аккаунты, с которыми вы взаимодействуете; время, частота и
  продолжительность ваших действий. Например, мы регистрируем данные о том, когда вы
  используете и в последний раз использовали наши Продукты, какие публикации, видео и
  другой контент вы просматриваете в наших Продуктах. Мы также собираем информацию о
  том, как вы используете такие функции, как наша камера. Информация о транзакциях,
  совершаемых в наших Продуктах. Если вы используете наши Продукты для покупок или
  других финансовых транзакций (например, когда вы совершаете покупку в игре или делаете
  пожертвование), мы собираем сведения о покупке или транзакции. К ним относится
  платежная информация, например номер кредитной или дебетовой карты и другие данные о
  ней, другая информация о счете и аутентификации, выставлении счета и доставке, а также
  контактные данные. Действия других людей и предоставляемая ими информация о вас. Мы
  также получаем и анализируем контент, сообщения и информацию, которые другие люди
  предоставляют при использовании ими наших Продуктов. Это может быть информация о вас,
  например когда другие люди делятся фото с вами или комментируют такое фото, отправляют
  вам сообщение, загружают, синхронизируют или импортируют вашу контактную информацию.
  Информация с устройств. Как описано ниже, мы собираем информацию с используемых вами
  компьютеров, телефонов, подключенного ТВ (connected TV) и других подключенных к
  Интернету устройств, интегрируемых с нашими Продуктами, а также информацию об этих
  устройствах, и объединяем такие данные с разных устройств, которые вы используете.
  Например, мы используем собранную нами информацию о том, как вы используете наши
  Продукты на своем телефоне, для более эффективной персонализации контента (включая
  рекламу) или функций, которые вы видите при использовании наших Продуктов на другом
  устройстве, например на ноутбуке или планшете, либо для определения, совершили ли вы
  какие-либо действия в ответ на рекламу, показанную нами на вашем телефоне, на другом
  устройстве. Мы получаем с этих устройств следующую информацию: Атрибуты устройства:
  такая информация, как операционная система, версии аппаратного и программного
  обеспечения, уровень заряда аккумулятора, сила сигнала, объем доступной памяти, тип
  браузера, имена и типы приложений и файлов, а также плагины. Действия на устройстве:
  информация о действиях на устройстве: расположение окна на переднем или заднем плане,
  движения указателя мыши (это помогает отличить ботов от людей). Идентификаторы:
  уникальные идентификаторы, идентификаторы устройств и другие идентификаторы, например
  игр, приложений или аккаунтов, которые вы используете, а также общие ID устройств (или
  другие идентификаторы, уникальные для Продуктов компаний Facebook, связанные с тем же
  устройством или аккаунтом). Сигналы устройств: сигналы Bluetooth и информация о
  расположенных поблизости точках доступа Wi-Fi, маячках и вышках сотовой связи. Данные
  из настроек устройства: информация, которую вы разрешаете нам получать путем включения
  настроек устройства, таких как доступ к данным о вашем местоположении (GPS), камере
  или фото. Сеть и подключения: такая информация, как название вашего мобильного
  оператора или провайдера, язык, часовой пояс, номер мобильного телефона, IP-адрес,
  скорость соединения и в некоторых случаях информация о других устройствах,
  расположенных поблизости или входящих в вашу сеть, чтобы мы могли выполнять такие
  операции, как потоковая передача видео с вашего телефона на телевизор. Данные файлов
  cookie: данные из файлов cookie, хранящихся на вашем устройстве, в том числе
  идентификаторы и настройки файлов cookie. Подробнее о том, как мы используем файлы
  cookie, см. в Политике Facebook в отношении файлов cookie и Политике Instagram в
  отношении файлов cookie. Информация от партнеров. Рекламодатели, разработчики
  приложений и издатели могут отправлять нам информацию с помощью используемых ими
  Инструментов Facebook для бизнеса, в том числе наших социальных плагинов (таких как
  кнопка "Нравится"), "Входа через Facebook", наших API и SDK либо пикселя Facebook. Эти
  партнеры предоставляют информацию о ваших действиях вне Facebook — в том числе
  информацию о вашем устройстве, посещаемых вами сайтах, совершаемых вами покупках,
  просматриваемой вами рекламе и использовании вами их сервисов — независимо от наличия
  у вас аккаунта Facebook и входа в него. Например, разработчик игр может использовать
  наш API, чтобы сообщать нам, в какие игры вы играете, а компания может сообщать нам о
  покупках, совершенных вами в ее магазине. Мы также получаем информацию о ваших
  действиях и покупках в сети Интернет и вне ее от сторонних поставщиков данных, имеющих
  право предоставлять нам вашу информацию. Партнеры получают ваши данные, когда вы
  посещаете или используете их сервисы, либо через третьи стороны, с которыми они
  сотрудничают. Мы требуем, чтобы перед предоставлением нам каких-либо данных о вас
  каждый из этих партнеров получил законные права на сбор, использование и передачу
  ваших данных. Подробнее о том, какие типы партнеров предоставляют нам информацию.
  Подробнее о том, как мы используем файлы cookie в связи с Инструментами Facebook для
  бизнеса, см. в Политике Facebook в отношении файлов cookie и в Политике Instagram в
  отношении файлов cookie.`;
